{"format": "graph-model", "generatedBy": "2.10.0", "convertedBy": "TensorFlow.js Converter v3.19.0", "signature": {"inputs": {"input_1": {"name": "input_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "512"}, {"size": "512"}, {"size": "1"}]}}}, "outputs": {"conv2d_3": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "512"}, {"size": "512"}, {"size": "1"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/model/conv2d_transpose_2/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/conv2d_transpose_2/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/conv2d_transpose_2/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model/conv2d_transpose_2/stack/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model/conv2d_transpose_2/stack/2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model/conv2d_transpose_2/stack/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/conv2d_transpose_2/conv2d_transpose/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/model/conv2d_transpose_1/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model/conv2d_transpose_1/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model/conv2d_transpose_1/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/conv2d_transpose_1/stack/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model/conv2d_transpose_1/stack/2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model/conv2d_transpose_1/stack/3", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model/conv2d_transpose_1/conv2d_transpose/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_transpose/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model/conv2d_transpose/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/conv2d_transpose/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model/conv2d_transpose/stack/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model/conv2d_transpose/stack/2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model/conv2d_transpose/stack/3", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model/conv2d_transpose/conv2d_transpose/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/dense/Tensordot/Const", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model/dense/Tensordot/axes", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model/dense/Tensordot/GatherV2_1/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model/dense/Tensordot/Const_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/dense/Tensordot/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "1"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_1/Conv2D/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/model/conv2d_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/model/conv2d_2/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_2/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/model/dense/Tensordot/free", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/dense/Tensordot/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/dense/Tensordot/Const_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model/dense/Tensordot/concat_1/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model/dense/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/model/conv2d_transpose/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/model/conv2d_transpose_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/model/conv2d_transpose_2/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/model/conv2d_3/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_3/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "input_1", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "512"}, {"size": "512"}, {"size": "1"}]}}}}, {"name": "StatefulPartitionedCall/model/conv2d/Relu", "op": "_FusedConv2D", "input": ["input_1", "StatefulPartitionedCall/model/conv2d/Conv2D/ReadVariableOp", "StatefulPartitionedCall/model/conv2d/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "padding": {"s": "U0FNRQ=="}, "num_args": {"i": "1"}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/model/conv2d_1/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model/conv2d/Relu", "StatefulPartitionedCall/model/conv2d_1/Conv2D/ReadVariableOp", "StatefulPartitionedCall/model/conv2d_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "U0FNRQ=="}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/model/conv2d_2/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model/conv2d_1/Relu", "StatefulPartitionedCall/model/conv2d_2/Conv2D/ReadVariableOp", "StatefulPartitionedCall/model/conv2d_2/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "StatefulPartitionedCall/model/dense/Tensordot/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/model/conv2d_2/Relu"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/dense/Tensordot/GatherV2_1", "op": "GatherV2", "input": ["StatefulPartitionedCall/model/dense/Tensordot/Shape", "StatefulPartitionedCall/model/dense/Tensordot/axes", "StatefulPartitionedCall/model/dense/Tensordot/GatherV2_1/axis"], "attr": {"Taxis": {"type": "DT_INT32"}, "Tparams": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}, "Tindices": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/dense/Tensordot/GatherV2", "op": "GatherV2", "input": ["StatefulPartitionedCall/model/dense/Tensordot/Shape", "StatefulPartitionedCall/model/dense/Tensordot/free", "StatefulPartitionedCall/model/dense/Tensordot/GatherV2/axis"], "attr": {"Tindices": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}, "Tparams": {"type": "DT_INT32"}, "Taxis": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/dense/Tensordot/Prod_1", "op": "Prod", "input": ["StatefulPartitionedCall/model/dense/Tensordot/GatherV2_1", "StatefulPartitionedCall/model/dense/Tensordot/Const_1"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/dense/Tensordot/Prod", "op": "Prod", "input": ["StatefulPartitionedCall/model/dense/Tensordot/GatherV2", "StatefulPartitionedCall/model/dense/Tensordot/Const"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/dense/Tensordot/concat_1", "op": "ConcatV2", "input": ["StatefulPartitionedCall/model/dense/Tensordot/GatherV2", "StatefulPartitionedCall/model/dense/Tensordot/Const_2", "StatefulPartitionedCall/model/dense/Tensordot/concat_1/axis"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/dense/Tensordot/stack", "op": "Pack", "input": ["StatefulPartitionedCall/model/dense/Tensordot/Prod", "StatefulPartitionedCall/model/dense/Tensordot/Prod_1"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/model/dense/Tensordot/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/model/conv2d_2/Relu", "StatefulPartitionedCall/model/dense/Tensordot/stack"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/dense/Tensordot/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/model/dense/Tensordot/Reshape", "StatefulPartitionedCall/model/dense/Tensordot/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/dense/Tensordot", "op": "Reshape", "input": ["StatefulPartitionedCall/model/dense/Tensordot/MatMul", "StatefulPartitionedCall/model/dense/Tensordot/concat_1"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/dense/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/model/dense/Tensordot", "StatefulPartitionedCall/model/dense/BiasAdd/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/model/dense/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model/dense/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_transpose/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/model/dense/Relu"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_transpose/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model/conv2d_transpose/Shape", "StatefulPartitionedCall/model/conv2d_transpose/strided_slice/stack", "StatefulPartitionedCall/model/conv2d_transpose/strided_slice/stack_1", "StatefulPartitionedCall/model/conv2d_transpose/strided_slice/stack_2"], "attr": {"ellipsis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model/conv2d_transpose/stack", "op": "Pack", "input": ["StatefulPartitionedCall/model/conv2d_transpose/strided_slice", "StatefulPartitionedCall/model/conv2d_transpose/stack/1", "StatefulPartitionedCall/model/conv2d_transpose/stack/2", "StatefulPartitionedCall/model/conv2d_transpose/stack/3"], "attr": {"axis": {"i": "0"}, "N": {"i": "4"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/conv2d_transpose/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/model/conv2d_transpose/stack", "StatefulPartitionedCall/model/conv2d_transpose/conv2d_transpose/ReadVariableOp", "StatefulPartitionedCall/model/dense/Relu"], "attr": {"padding": {"s": "U0FNRQ=="}, "explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/model/conv2d_transpose/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/model/conv2d_transpose/conv2d_transpose", "StatefulPartitionedCall/model/conv2d_transpose/BiasAdd/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/model/conv2d_transpose/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model/conv2d_transpose/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_transpose_1/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/model/conv2d_transpose/Relu"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_transpose_1/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model/conv2d_transpose_1/Shape", "StatefulPartitionedCall/model/conv2d_transpose_1/strided_slice/stack", "StatefulPartitionedCall/model/conv2d_transpose_1/strided_slice/stack_1", "StatefulPartitionedCall/model/conv2d_transpose_1/strided_slice/stack_2"], "attr": {"end_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}}}, {"name": "StatefulPartitionedCall/model/conv2d_transpose_1/stack", "op": "Pack", "input": ["StatefulPartitionedCall/model/conv2d_transpose_1/strided_slice", "StatefulPartitionedCall/model/conv2d_transpose_1/stack/1", "StatefulPartitionedCall/model/conv2d_transpose_1/stack/2", "StatefulPartitionedCall/model/conv2d_transpose_1/stack/3"], "attr": {"N": {"i": "4"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/conv2d_transpose_1/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/model/conv2d_transpose_1/stack", "StatefulPartitionedCall/model/conv2d_transpose_1/conv2d_transpose/ReadVariableOp", "StatefulPartitionedCall/model/conv2d_transpose/Relu"], "attr": {"data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_transpose_1/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/model/conv2d_transpose_1/conv2d_transpose", "StatefulPartitionedCall/model/conv2d_transpose_1/BiasAdd/ReadVariableOp"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_transpose_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model/conv2d_transpose_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_transpose_2/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/model/conv2d_transpose_1/Relu"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_transpose_2/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model/conv2d_transpose_2/Shape", "StatefulPartitionedCall/model/conv2d_transpose_2/strided_slice/stack", "StatefulPartitionedCall/model/conv2d_transpose_2/strided_slice/stack_1", "StatefulPartitionedCall/model/conv2d_transpose_2/strided_slice/stack_2"], "attr": {"end_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}}}, {"name": "StatefulPartitionedCall/model/conv2d_transpose_2/stack", "op": "Pack", "input": ["StatefulPartitionedCall/model/conv2d_transpose_2/strided_slice", "StatefulPartitionedCall/model/conv2d_transpose_2/stack/1", "StatefulPartitionedCall/model/conv2d_transpose_2/stack/2", "StatefulPartitionedCall/model/conv2d_transpose_2/stack/3"], "attr": {"N": {"i": "4"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/conv2d_transpose_2/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/model/conv2d_transpose_2/stack", "StatefulPartitionedCall/model/conv2d_transpose_2/conv2d_transpose/ReadVariableOp", "StatefulPartitionedCall/model/conv2d_transpose_1/Relu"], "attr": {"data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}}}, {"name": "StatefulPartitionedCall/model/conv2d_transpose_2/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/model/conv2d_transpose_2/conv2d_transpose", "StatefulPartitionedCall/model/conv2d_transpose_2/BiasAdd/ReadVariableOp"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_transpose_2/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model/conv2d_transpose_2/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_3/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model/conv2d_transpose_2/Relu", "StatefulPartitionedCall/model/conv2d_3/Conv2D/ReadVariableOp", "StatefulPartitionedCall/model/conv2d_3/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "data_format": {"s": "TkhXQw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "StatefulPartitionedCall/model/conv2d_3/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/model/conv2d_3/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/model/conv2d_3/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1087}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/model/conv2d_transpose_2/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/conv2d_transpose_2/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/conv2d_transpose_2/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/conv2d_transpose_2/stack/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/conv2d_transpose_2/stack/2", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/conv2d_transpose_2/stack/3", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/conv2d_transpose_2/conv2d_transpose/ReadVariableOp", "shape": [3, 3, 16, 16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/conv2d_transpose_1/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/conv2d_transpose_1/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/conv2d_transpose_1/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/conv2d_transpose_1/stack/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/conv2d_transpose_1/stack/2", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/conv2d_transpose_1/stack/3", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/conv2d_transpose_1/conv2d_transpose/ReadVariableOp", "shape": [3, 3, 16, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/conv2d_transpose/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/conv2d_transpose/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/conv2d_transpose/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/conv2d_transpose/stack/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/conv2d_transpose/stack/2", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/conv2d_transpose/stack/3", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/conv2d_transpose/conv2d_transpose/ReadVariableOp", "shape": [3, 3, 32, 16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/dense/Tensordot/Const", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/dense/Tensordot/axes", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/dense/Tensordot/GatherV2_1/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/dense/Tensordot/Const_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/dense/Tensordot/ReadVariableOp", "shape": [32, 16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/conv2d/Conv2D/ReadVariableOp", "shape": [3, 3, 1, 16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/conv2d/BiasAdd/ReadVariableOp", "shape": [16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/conv2d_1/Conv2D/ReadVariableOp", "shape": [3, 3, 16, 16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/conv2d_1/BiasAdd/ReadVariableOp", "shape": [16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/conv2d_2/Conv2D/ReadVariableOp", "shape": [3, 3, 16, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/conv2d_2/BiasAdd/ReadVariableOp", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/dense/Tensordot/free", "shape": [3], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/dense/Tensordot/GatherV2/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/dense/Tensordot/Const_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/dense/Tensordot/concat_1/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/dense/BiasAdd/ReadVariableOp", "shape": [16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/conv2d_transpose/BiasAdd/ReadVariableOp", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/conv2d_transpose_1/BiasAdd/ReadVariableOp", "shape": [16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/conv2d_transpose_2/BiasAdd/ReadVariableOp", "shape": [16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/conv2d_3/Conv2D/ReadVariableOp", "shape": [3, 3, 16, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/conv2d_3/BiasAdd/ReadVariableOp", "shape": [1], "dtype": "float32"}]}]}